sites/main/org/2010-11-01-testing-jekyll-posting.org
#+DATE: [2010-11-01 ma 10:57]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil TeX:nil
#+TAGS: Uncategorized, Hello
#+TAGS:
#+DESCRIPTION:
#+TITLE: Testing jekyll posting

The intent of this file is to represent the way in which I would like
a blog posting to be, i.e. a plain org file.

On posting this entry, I envision that the following should happen:

1. Convert the properties in the header to a yaml formatted header;
2. Convert the body to markdown or html (perhaps the latter is best,
   one step less to worry about)
3. Save the result in the expected format by jekyll in the right
   place;

org-jekyll seems to do just that, or something very close to it.
