sites/main/_posts/2010-11-01-testing-jekyll-posting.html
---
title: Testing jekyll posting
published: false
---

<p>
The intent of this file is to represent the way in which I would like
a blog posting to be, i.e. a plain org file.
</p>

<p>
On posting this entry, I envision that the following should happen:
</p>

<ol class="org-ol">
<li>Convert the properties in the header to a yaml formatted header;
</li>
<li>Convert the body to markdown or html (perhaps the latter is best,
one step less to worry about)
</li>
<li>Save the result in the expected format by jekyll in the right
place;
</li>
</ol>

<p>
org-jekyll seems to do just that, or something very close to it.
</p>
